Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.NoRoomsWarn Property
 Revit was unable to identify any rooms. If you are sure that rooms have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which rooms have been defined in your project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRoomsWarn { get; }
Public Shared ReadOnly Property NoRoomsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRoomsWarn {
	FailureDefinitionId^ get ();
}
static member NoRoomsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace